Revit 2027 API
ImageExportOptions.ShadowViewsFileType Property
 The file type for exported shadow views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ImageFileType ShadowViewsFileType { get; set; }
Public Property ShadowViewsFileType As ImageFileType
	Get
	Set
public:
property ImageFileType ShadowViewsFileType {
	ImageFileType get ();
	void set (ImageFileType value);
}
member ShadowViewsFileType : ImageFileType with get, set
Property Value
ImageFileType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
 The default is JPEGMedium. This field is ignored if used to save an image to a project as a new view.
See Also
Reference
ImageExportOptions Class
Autodesk.Revit.DB Namespace